## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda_app_invoke will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_app_invoke"  {
      ~ id      = "1288085949" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ca-central-1:687401027353:function:Templates",
                          - "arn:aws:lambda:ca-central-1:687401027353:function:Submission",
                          - "arn:aws:lambda:ca-central-1:687401027353:function:Retrieval",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_iam_policy.lambda_app_invoke will be updated in-place
  ~ resource "aws_iam_policy" "lambda_app_invoke" {
        id          = "arn:aws:iam::687401027353:policy/lambda_app_invoke"
        name        = "lambda_app_invoke"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ca-central-1:687401027353:function:Retrieval",
                          - "arn:aws:lambda:ca-central-1:687401027353:function:Templates",
                          - "arn:aws:lambda:ca-central-1:687401027353:function:Submission",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.retrieval will be updated in-place
  ~ resource "aws_lambda_function" "retrieval" {
        id                             = "Retrieval"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages:11",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.retrieval_lib must be replaced
-/+ resource "aws_lambda_layer_version" "retrieval_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages:11" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2021-12-02T19:20:58.962+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages:11" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "K2Ew0nBsgDx5iBk3TTt3+l5UYLKmJ5fIC3w1YJKKyF8=" -> "8bc7qRyh8/gmm4WcmTalv8YDJOEHGdlavbD1cENMzqo=" # forces replacement
      ~ source_code_size            = 2352354 -> (known after apply)
      ~ version                     = "11" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
